import React from 'react'
import styles from "@/app/page.module.css"
import Image from 'next/image'
export const metadata = {
  title: 'روابط البث المباشر',
  description: 'البث المباشر: يوفر الموقع بث مباشر للمباريات بجودة عالية وبدون تأخير، مما يسمح للمشاهدين بالاستمتاع باللقطات الحية والأهداف والتفاصيل الحماسية في الوقت الفعلي.',
  keywords: ["libe koora, kora ĺive, koora4lives ,بث مباشر,kooora lıve,yallakora live,yalla_shoot com, koooragoal,live koora online,yalla shoot 365,live kooraonline"],
  icons: {
    icon: '/4.svg',
  }
  
}

const page = async() => {
  const data = await getData()
  const filtereddata=[];
 await  data?.find((item) => {
    if(item.newCollection === "match"){
      filtereddata.push(item)
    }});
 
  return (
    <div className={styles.main}> 

      <h1>بث مباشر مباريات كرة القدم</h1>
      <h2 style={{ color: "green" }}>روابط بث مباشر لأهم مباريات كرة القدم العالمية</h2>
      <h3 >لمشاهدة روابط البث المباشر للمباريات الحالية </h3>
      <h3 style={{ color: "rgb(119, 2, 29)" }}>روابط البث المباشر في أسفل الصفحة</h3>
      <div>
        مرحبًا بكم في موقعنا الإلكتروني لبث المباريات المباشرة! نحن فخورون بتقديم أفضل تجربة مشاهدة لمحبي كرة القدم حول العالم. انضم إلينا للاستمتاع بأحدث الأحداث الرياضية وأكثرها إثارة.

        تعتبر كرة القدم هواية محبوبة وشغف عارم في جميع أنحاء العالم، ونحن نفخر بتقديم بث مباشر لأشهر الأندية العالمية وأهم الدوريات الكروية. من برشلونة وريال مدريد في إسبانيا، إلى ليفربول ومانشستر يونايتد في إنجلترا، ومن بايرن ميونخ وبوروسيا دورتموند في ألمانيا، إلى يوفنتوس وميلان في إيطاليا. لا ننسى بالطبع باريس سان جيرمان في فرنسا، وبوكا جونيورز وريفر بليت في الأرجنتين، فضلًا عن العديد من الأندية الأخرى الرائعة التي تضمنتها البطولات العالمية.

        نحن نهدف إلى توفير جودة بث عالية واستقرار في الاتصال لضمان أنك تستمتع بأكبر قدر ممكن من المباريات المثيرة والمنافسات الحماسية. بغض النظر عن انتماءاتك الكروية، فإننا نغطي أحداث العديد من الدوريات والبطولات المهمة في جميع أنحاء العالم، بما في ذلك دوري الأبطال، والدوريات المحلية، وكأس العالم.

        انضم إلينا الآن واحصل على فرصة لمشاهدة نجوم الكرة في عروضهم الممتعة وهم يتنافسون على اللقب والانتصارات. ابق على اطلاع دائم بجدول المباريات ولا تفوت أي لحظة من المتعة والتشويق.

        نحن نتطلع إلى مشاركتكم الرائعة وتجربة كرة القدم الحماسية معنا. دعونا نمنحكم أفضل تجربة رياضية عبر الإنترنت، حيث يجتمع الحماس والمتعة في مكان واحد. شكراً لثقتكم بنا ومشاركتنا هذه الرحلة الرائعة في عالم كرة القدم!
      </div>

      <Image
        src="https://mediakwest.com/wp-content/uploads/2018/08/VRSport.002.jpeg"
        alt="بث مباشر"
        className={styles.handleImg}
        layout="responsive"
        width="500"
        height="500"
        objectFit="cover"
        objectPosition="center"
      />

      <h1 style={{ color: "green" }}>تردد قنوات بين سبورت على نايل سات 2023: خيارات البث لعشاق كرة القدم والرياضة في الوطن العربي</h1>
      <div>
        العنوان: تردد قنوات بين سبورت على نايل سات 2023 خيارات البث لعشاق كرة القدم والرياضة في الوطن العربي

        موضوع البحث عند العديد من محبي كرة القدم والرياضة بصفة عامة في الوطن العربي هو تردد قنوات بين سبورت على نايل سات لعام 2023 وذلك نظرًا لاقتراب موعد كأس العالم. وبما أن شبكة قنوات بي ان سبورت beIN SPORT تحمل حقوق البث الحصري لكأس العالم ومختلف الدوريات العالمية، يقوم المشاهدون بضبط أجهزة الاستقبال الخاصة بهم عن طريق إضافة ترددات قنوات بين سبورت المتوفرة على القمر الصناعي NileSat وغيره من الأقمار الأخرى. وبناءً عليه، سوف نستعرض جميع ترددات قناة bein sport التي يمكن الاستمتاع بها.

        يرجى ملاحظة أن الترددات قد تختلف حسب المنطقة الجغرافية ومواصفات الاستقبال الفردية. لذا يُفضل للمشاهدين الاطلاع على موقع شبكة قنوات beIN SPORT أو التواصل مع مزود الخدمة للحصول على أحدث التحديثات والترددات المناسبة لمنطقتهم.
      </div>

      <h1>ميسي في انتر ميامي</h1>
      <h4>بث مباشر ميسي  مع فريق انتر ميامي</h4>
      <div>
        عشاق كرة القدم يا لهم من يومٍ مميز! فقد تحققت الأحلام والتوقعات بشكل مذهل حينما قرر النجم الأرجنتيني ليونيل ميسي انتقاله إلى نادي إنتر ميامي، النادي الذي أسسه ديفيد بيكهام وخطف قلوب الملايين حول العالم. ما جعل هذا الإعلان مثيراً للجدل والحماس هو أن ميسي قرر ترك برشلونة، النادي الذي كان له السيطرة على قلوب الجماهير لأكثر من عقد من الزمن.

        منذ وصوله إلى إنتر ميامي، بدأت مشاركات ميسي في المباريات تلقى تفاعلًا هائلًا من الجماهير ووسائل الإعلام. توقعاتٌ عالية تحيط به في كل مباراة يشارك فيها، وعشاقه ينتظرون بفارغ الصبر لرؤية إبداعاته الساحرة على أرض الملعب. يُذكر أن إنتر ميامي نادٍ جديد نسبياً في مشواره، ولكن تواجد ميسي أضاف له الكثير من الجاذبية والشهرة.

        منذ توقيعه على عقد انتقاله، لم يتمكن عشاق ميسي من كبح حماسهم وفضولهم حول متابعة مباريات إنتر ميامي بث مباشر. الانتظار كان طويلاً لرؤية الفرحة والابتسامة على وجوه جماهير النادي، وكانت تلك المشاهد واللحظات المثيرة على أرض الملعب تجعل ميسي النقطة الحديثة في كل نقاش حول الرياضة وكرة القدم.

        بفضل تألقه اللافت في المباريات، أثبت ميسي أنه لا يزال يملك السحر والإبداع الذي جعله أسطورة في عالم كرة القدم. يبدو أن انتقاله إلى إنتر ميامي أعطاه دفعة إضافية من الحماس والرغبة في تحقيق المزيد من الانتصارات وتقديم عروضٍ استثنائية.

        في الختام، فإن انتقال ليونيل ميسي إلى إنتر ميامي كان حدثاً كروياً استثنائياً، حيث أضاف الكثير من الإثارة والجمال لعالم كرة القدم. تبقى المتعة في متابعة مشاركاته في المباريات والاستمتاع بلمساته الساحرة والمهارات الاستثنائية التي تجعله لاعباً فريداً من نوعه في تاريخ كرة القدم.
      </div>

      <Image
        src="https://i.ytimg.com/vi/jpGd7G5-Al0/maxresdefault.jpg"
        alt=" ميسي في ميامي بث مباشر"
        className={styles.handleImg}
        layout="responsive"
        width="500"
        height="500"
        objectFit="cover"
        objectPosition="center"
      />
<h1>روابط البث المباشر لأهم المواقع على الانترنت أو على اليوتيوب او توتير او تلجلرام </h1>
<h2>نوفر في موقعنا اهم روابط البث المباشر للمباريات التي تناسب المشاهدين على أهم مواقع التواصل الأجتماعي</h2>



<div className={styles.matchs}>
{filtereddata?.map((match) => {
    return (
      <div key={match._id} className={styles.match}>
        <h1>{match.newTitle}</h1>
        <a  href={match.newContent}>{match.newContent}</a>
      </div>
    );
  })}
</div>




    </div>
  )
}

export default page

export async function getData() {
  const res = await fetch('https://greenzone-eight.vercel.app/api/mydata',

    { next: { revalidate: 10 } }
  );

  if (!res.ok) {
    throw new Error('Failed to fetch data');
  }

  return res.json();
}